Autodesk.Revit.DB.RevisionCloud.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve})
Creates a new RevisionCloud in the model.
Remarks:
Creates a new RevisionCloud in the specified View.  The new RevisionCloud will be associated with the specified Revision.
RevisionClouds can only be created if the Revision has not yet been issued.
RevisionClouds can be created in most graphical Views, excepting 3D views and graphical column schedules.  Unlike
most other Elements, RevisionClouds can be created directly on a ViewSheet.RevisionClouds are created based on a series of sketched curves.  There is no requirement that the curves form
closed loops and self-intersections are also permitted.  The curves will be automatically projected onto the appropriate
plane for the View.  The list of curves cannot be empty and any lines cannot be perpendicular to the View's plane.
If the View is a model View, the coordinates specified for the curves will be interpreted in model space.  If the View
is a non-model View (such as a ViewSheet) then the coordinates will be interpreted in the View's space.The cloud graphics will be attached to the curves under the assumption that each curve is oriented in a clockwise direction.
For lines, this means that the outside of the cloud is in the direction of the line's normal vector within the View's plane.  Any closed loops should
therefore be oriented clockwise to create the typical cloud shape.
document:
The document in which the RevisionCloud should be created.
view:
The View in which the RevisionCloud should appear.
revisionId:
The Revision to associate with the new RevisionCloud.
curves:
The curves that will form the RevisionCloud's sketch.
Returns:
The newly created RevisionCloud.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
revisionId is not a valid Revision.
-or-
This operation cannot be performed because revisionId is an issued Revision.
-or-
view is not a View that can support RevisionClouds.
-or-
The provided Curves curves cannot be used as the basis for a RevisionCloud.  Either the list is empty or
one or more of the Curves could not be projected onto the View's plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.RevisionCloud.RevisionId
The Revision associated with this RevisionCloud.
Remarks:
This property cannot be set to a Revision that has already been issued.  If this RevisionCloud is already associated
with a Revision that has been issued then this property cannot be changed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: revisionId is not a valid Revision.
-or-
When setting this property: This operation cannot be performed because revisionId is an issued Revision.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation cannot be performed on a RevisionCloud associated with a Revision that has been issued.
Since:
2015